<---pandas---->
<---used to handle large data sets--->
<---pip install pandas----->

In [4]:
import pandas as pd
import numpy as np

In [ ]:
data = {"Name" : ["amal","arun","sanjay"],            # Two dimension
        "Role" : ["Hr","Dev","Testing"],
        "Place": ["kochi","chennai","tvm"],
        "Salary":["10000","20000","30000"]}

result = pd.DataFrame(data)             # DataFrame for 2D
result

     Name     Role    Place Salary
0    amal       Hr    kochi  10000
1    arun      Dev  chennai  20000
2  sanjay  Testing      tvm  30000

In [ ]:
data1 = {"name" : "neema","role" : "intern","place" : "ekm"}  # one dimension

result = pd.Series(data1)    #  Series for 1D
result

name      neema
role     intern
place       ekm
dtype: object